# Version Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransmissionData..::..Version Property
TransmissionData Class See Also
---
The format version for TransmissionData
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int Version { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Version As Integer
	Get
```

Visual C++
---
```text
public:
property int Version {
	int get ();
}
```

# See Also
TransmissionData Class
Autodesk.Revit.DB Namespace